MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33FJ06GS101A/mcu.h
#define _RPINR32_FLT6R0_POSITION                 0x00000000
#define _RPINR32_FLT6R0_MASK                     0x00000001
#define _RPINR32_FLT6R0_LENGTH                   0x00000001

#define _RPINR32_FLT6R1_POSITION                 0x00000001
#define _RPINR32_FLT6R1_MASK                     0x00000002
#define _RPINR32_FLT6R1_LENGTH                   0x00000001

#define _RPINR32_FLT6R2_POSITION                 0x00000002
#define _RPINR32_FLT6R2_MASK                     0x00000004
#define _RPINR32_FLT6R2_LENGTH                   0x00000001

#define _RPINR32_FLT6R3_POSITION                 0x00000003
#define _RPINR32_FLT6R3_MASK                     0x00000008
#define _RPINR32_FLT6R3_LENGTH                   0x00000001

#define _RPINR32_FLT6R4_POSITION                 0x00000004
#define _RPINR32_FLT6R4_MASK                     0x00000010
#define _RPINR32_FLT6R4_LENGTH                   0x00000001

#define _RPINR32_FLT6R5_POSITION                 0x00000005
#define _RPINR32_FLT6R5_MASK                     0x00000020
#define _RPINR32_FLT6R5_LENGTH                   0x00000001

#define _RPINR32_FLT7R0_POSITION                 0x00000008
#define _RPINR32_FLT7R0_MASK                     0x00000100
#define _RPINR32_FLT7R0_LENGTH                   0x00000001

#define _RPINR32_FLT7R1_POSITION                 0x00000009
#define _RPINR32_FLT7R1_MASK                     0x00000200
#define _RPINR32_FLT7R1_LENGTH                   0x00000001

#define _RPINR32_FLT7R2_POSITION                 0x0000000A
#define _RPINR32_FLT7R2_MASK                     0x00000400
#define _RPINR32_FLT7R2_LENGTH                   0x00000001

#define _RPINR32_FLT7R3_POSITION                 0x0000000B
#define _RPINR32_FLT7R3_MASK                     0x00000800
#define _RPINR32_FLT7R3_LENGTH                   0x00000001

#define _RPINR32_FLT7R4_POSITION                 0x0000000C
#define _RPINR32_FLT7R4_MASK                     0x00001000
#define _RPINR32_FLT7R4_LENGTH                   0x00000001

#define _RPINR32_FLT7R5_POSITION                 0x0000000D
#define _RPINR32_FLT7R5_MASK                     0x00002000
#define _RPINR32_FLT7R5_LENGTH                   0x00000001

#define _RPINR33_FLT8R_POSITION                  0x00000000
#define _RPINR33_FLT8R_MASK                      0x0000003F
#define _RPINR33_FLT8R_LENGTH                    0x00000006

#define _RPINR33_SYNCI1R_POSITION                0x00000008
#define _RPINR33_SYNCI1R_MASK                    0x00003F00
#define _RPINR33_SYNCI1R_LENGTH                  0x00000006

#define _RPINR33_FLT8R0_POSITION                 0x00000000
#define _RPINR33_FLT8R0_MASK                     0x00000001
#define _RPINR33_FLT8R0_LENGTH                   0x00000001

#define _RPINR33_FLT8R1_POSITION                 0x00000001
#define _RPINR33_FLT8R1_MASK                     0x00000002
#define _RPINR33_FLT8R1_LENGTH                   0x00000001

#define _RPINR33_FLT8R2_POSITION                 0x00000002
#define _RPINR33_FLT8R2_MASK                     0x00000004
#define _RPINR33_FLT8R2_LENGTH                   0x00000001

#define _RPINR33_FLT8R3_POSITION                 0x00000003
#define _RPINR33_FLT8R3_MASK                     0x00000008
#define _RPINR33_FLT8R3_LENGTH                   0x00000001

#define _RPINR33_FLT8R4_POSITION                 0x00000004
#define _RPINR33_FLT8R4_MASK                     0x00000010
#define _RPINR33_FLT8R4_LENGTH                   0x00000001

#define _RPINR33_FLT8R5_POSITION                 0x00000005
#define _RPINR33_FLT8R5_MASK                     0x00000020
#define _RPINR33_FLT8R5_LENGTH                   0x00000001

#define _RPINR33_SYNCI1R0_POSITION               0x00000008
#define _RPINR33_SYNCI1R0_MASK                   0x00000100
#define _RPINR33_SYNCI1R0_LENGTH                 0x00000001

#define _RPINR33_SYNCI1R1_POSITION               0x00000009
#define _RPINR33_SYNCI1R1_MASK                   0x00000200
#define _RPINR33_SYNCI1R1_LENGTH                 0x00000001

#define _RPINR33_SYNCI1R2_POSITION               0x0000000A
#define _RPINR33_SYNCI1R2_MASK                   0x00000400
#define _RPINR33_SYNCI1R2_LENGTH                 0x00000001

#define _RPINR33_SYNCI1R3_POSITION               0x0000000B
#define _RPINR33_SYNCI1R3_MASK                   0x00000800
#define _RPINR33_SYNCI1R3_LENGTH                 0x00000001

#define _RPINR33_SYNCI1R4_POSITION               0x0000000C
#define _RPINR33_SYNCI1R4_MASK                   0x00001000
#define _RPINR33_SYNCI1R4_LENGTH                 0x00000001

#define _RPINR33_SYNCI1R5_POSITION               0x0000000D
#define _RPINR33_SYNCI1R5_MASK                   0x00002000
#define _RPINR33_SYNCI1R5_LENGTH                 0x00000001

#define _RPINR34_SYNCI2R_POSITION                0x00000000
#define _RPINR34_SYNCI2R_MASK                    0x0000003F
#define _RPINR34_SYNCI2R_LENGTH                  0x00000006

#define _RPINR34_SYNCI2R0_POSITION               0x00000000
#define _RPINR34_SYNCI2R0_MASK                   0x00000001
#define _RPINR34_SYNCI2R0_LENGTH                 0x00000001

#define _RPINR34_SYNCI2R1_POSITION               0x00000001
#define _RPINR34_SYNCI2R1_MASK                   0x00000002
#define _RPINR34_SYNCI2R1_LENGTH                 0x00000001

#define _RPINR34_SYNCI2R2_POSITION               0x00000002
#define _RPINR34_SYNCI2R2_MASK                   0x00000004
#define _RPINR34_SYNCI2R2_LENGTH                 0x00000001

#define _RPINR34_SYNCI2R3_POSITION               0x00000003
#define _RPINR34_SYNCI2R3_MASK                   0x00000008
#define _RPINR34_SYNCI2R3_LENGTH                 0x00000001

#define _RPINR34_SYNCI2R4_POSITION               0x00000004
#define _RPINR34_SYNCI2R4_MASK                   0x00000010
#define _RPINR34_SYNCI2R4_LENGTH                 0x00000001

#define _RPINR34_SYNCI2R5_POSITION               0x00000005
#define _RPINR34_SYNCI2R5_MASK                   0x00000020
#define _RPINR34_SYNCI2R5_LENGTH                 0x00000001

#define _RPOR0_RP0R_POSITION                     0x00000000
#define _RPOR0_RP0R_MASK                         0x0000003F
#define _RPOR0_RP0R_LENGTH                       0x00000006

#define _RPOR0_RP1R_POSITION                     0x00000008
#define _RPOR0_RP1R_MASK                         0x00003F00
#define _RPOR0_RP1R_LENGTH                       0x00000006

#define _RPOR0_RP0R0_POSITION                    0x00000000
#define _RPOR0_RP0R0_MASK                        0x00000001
#define _RPOR0_RP0R0_LENGTH                      0x00000001

#define _RPOR0_RP0R1_POSITION                    0x00000001
#define _RPOR0_RP0R1_MASK                        0x00000002
#define _RPOR0_RP0R1_LENGTH                      0x00000001

